#!/usr/bin/env python3
# -*- coding:utf-8 -*-

import json
import os
import platform
import re
import tempfile
import unicodedata
from pprint import pprint

from ArticutAPI import Articut
try:
    from .defaultDict import Taigi_Lexicon
    from .posShift import shiftRule
except:
    from defaultDict import Taigi_Lexicon
    from posShift import shiftRule

BASEPATH = os.path.dirname(os.path.abspath(__file__))

class ArticutTG:
    def __init__(self, username="", apikey="", usernameENG="", apikeyENG=""):
        #self.articut = Articut(username=username, apikey=apikey, url="http://10.1.1.182:50269")
        self.articut = Articut(username=username, apikey=apikey)
        self.articutENG = Articut(username=usernameENG, apikey=apikeyENG, url="https://nlu.droidtown.co")
        self.posPat = re.compile("<[^<]*>([^<]*)</([^<]*)>")
        self.TLPat = re.compile("\s?[\-a-zA-Záíúéóàìùèòâîûêôǎǐǔěǒāīūēō̋̍]+(-+[a-zA-Záíúéóàìùèòâîûêôǎǐǔěǒāīūēō̋̍]+)*\s?")
        self.userDefinedDICT = {}
        self.cjkPAT = re.compile('[\u4e00-\u9fff]')
        self.moeCSV = [[t.replace("\n", "") for t in l.split(",")] for l  in open("{}/defaultDict/moe_dict/詞目總檔.csv".format(BASEPATH), "r", encoding="utf-8").readlines()]
        self.DT_TL = Taigi_Lexicon.DT_TL
        self.purgePat = re.compile("</\w+(_\w+)?><\w+(_\w+)?>|</?\w+(_\w+)?>")
        self.shiftRule = shiftRule
        self.defaultDICT = Taigi_Lexicon.dictCombiner()
        self.legacyLIST = ["", "𪜶𪹚𫝏𫝘𫝙𫝛𫝞𫝺𫝻𫝾𫞭𫞻𫞼𫟂𫟊𫟧𫠛𫣆"]
        self.personPat = re.compile("(?<=<ENTITY_person>)[^<]+(?=</ENTITY_person>)")
    def _pos2Obj(self, posLIST):
        resultLIST = []
        for pos in posLIST:
            if '</' in pos:
                textPosLIST = [[p.group(1), p.group(2)] for p in self.posPat.finditer(pos)]
                # group(0) <ACTION_verb>結帳</ACTION_verb>
                # group(1) 結帳
                # group(2) ACTION_verb
                objLIST = []
                for txt, p in textPosLIST:
                    objLIST.append({
                        "text": txt,
                        "pos": p,
                    })
                if objLIST:
                    resultLIST.append(objLIST)
                else:
                    resultLIST.append([{
                        "text": pos,
                        "pos": 'PUNCTUATION',
                    }])
            else:
                resultLIST.append([{
                    "text": pos,
                    "pos": 'PUNCTUATION',
                }])
        return resultLIST

    def _2TL(self, posLIST):
        '''
        把 posLIST 裡的每一個詞，一一轉為 TL (台羅拼音)
        '''
        resultLIST = []
        for p in posLIST: #p 是一句
            for word in p:
                if "LATIN" in unicodedata.name(word["text"][0]):
                    resultLIST.append(word["text"])
                elif word["text"] in self.DT_TL:
                    resultLIST.append(self.DT_TL[word["text"]])
                elif word["text"] in [token[2] for token in self.moeCSV]:
                    tokenLIST = []
                    for token in self.moeCSV[1:]:
                        if token[2] == word["text"]:
                            tokenLIST.append(token[3])

                    if len(tokenLIST) > 1:
                        resultLIST.append("({})".format("/".join(tokenLIST)))
                    elif len(tokenLIST) == 1:
                        if "/" in tokenLIST[0]:
                            resultLIST.append("({})".format(tokenLIST[0]))
                        else:
                            resultLIST.append("{}".format(tokenLIST[0]))
                    else:
                        pass
                    tokenLIST = []
                else:
                    wordLIST = []
                    tokenLIST = []
                    for t in word["text"]:
                        for token in self.moeCSV:
                            if len(token[2]) == 1 and t == token[2]:
                                tokenLIST.append("{}".format(token[3]))

                        if len(tokenLIST) > 1:
                            wordLIST.append("({})".format("/".join(tokenLIST)))
                        elif len(tokenLIST) == 1:
                            wordLIST.append("{}".format(tokenLIST[0]))
                        tokenLIST = []
                    resultLIST.append("-".join(wordLIST))
        return resultLIST

#<ToDo>
    #def _2POJ(self, postLIST):
        #'''
        #把 posLIST 裡的每一個詞，一一轉為 POJ (白話字拼音)
        #'''
        #resultLIST = []
        #return resultLIST

    #def _2Word(self, posLIST):
        #'''
        #每次從 posLIST 中取一個詞彙，反查這個詞彙是 TL 或 POS 的拼音，依該拼音把同音詞彙找出來，並把這個詞彙同音的台語漢字加入回傳結果中。
        #'''
        #resultLIST = []
        #return resultLIST

    #def _TL2Word(self, TLLIST):
        #'''
        #把 TLLIST (台羅拼音)裡的每一個詞，一一轉為台語漢字
        #'''
        #resultLIST = []
        #return resultLIST

    #def _POJ2Word(self, POJLIST):
        #'''
        #把 POJLIST (白話字拼音)裡的每一個詞，一一轉為台語漢字
        #'''
        #resultLIST = []
        #return resultLIST
#</ToDo>
    def _mixedInputDetector(self, inputSTR):
        TLLIST = [t.group() for t in self.TLPat.finditer(inputSTR)]
        with open(self.TaigiDictFILE.name) as f:
            userDefinedDICT = json.load(f)

        #<特殊區塊：如果使用者有購買英文版 Articut 的使用額度，將調用英文人名偵測。>
        #<否則本功能會在每小時 2000 字免費額度用盡後失效，待下一個小時的免費額度啟用時才恢復>
        knownLIST = []
        for i in TLLIST:
            resultDICT = self.articutENG.parse(i, level="lv1")
            if resultDICT["status"] == True and resultDICT["msg"] == "Success!":
                if "<ENTITY_person>{}</ENTITY_person>".format(i) in "".join(resultDICT["result_pos"]):
                    knownLIST.append(i)
                    userDefinedDICT["ENTITY_person"].append(i)
                    self.userDefinedDICT["ENTITY_person"].append(i)
            else:
                pass
        TLLIST = list(set(TLLIST)-set(knownLIST))
        #</特殊區塊：如果使用者有購買英文版 Articut 的使用額度，將調用英文人名偵測>
        #</否則本功能會在每小時 2000 字免費額度用盡後失效，待下一個小時的免費額度啟用時才恢復>

        if TLLIST == []:
            pass
        else:
            #with open(self.userDefinedDictFILE.name) as f:
                #userDefinedDICT = json.load(f)
            if "_ArticutTaigiUserDefined" in userDefinedDICT.keys():
                userDefinedDICT["_ArticutTaigiUserDefined"].extend(TLLIST)
            else:
                userDefinedDICT["_ArticutTaigiUserDefined"] = TLLIST
            if platform.system() == "Windows":
                self.userDefinedDictFILE = tempfile.NamedTemporaryFile(mode="w+", delete=False)
            else:
                self.userDefinedDictFILE = tempfile.NamedTemporaryFile(mode="w+")
            json.dump(userDefinedDICT, self.userDefinedDictFILE)
            self.userDefinedDictFILE.flush()
        return None

    def _spaceWalker(self, inputDICT):
        '''
        移除非 CJK 字元前後的空格
        '''
        fposPat = re.compile("<UserDefined>\s")
        pposPat = re.compile("\s</UserDefined>")
        posPat = re.compile("</?\w_?[^>]+?>")
        for i in range(0, len(inputDICT["result_pos"])):
            inputDICT["result_pos"][i] = re.sub(fposPat, " <UserDefined>", inputDICT["result_pos"][i])
            inputDICT["result_pos"][i] = re.sub(pposPat, "</UserDefined> ", inputDICT["result_pos"][i])
            inputDICT["result_pos"][i] = inputDICT["result_pos"][i].strip()
        try:
            inputDICT["result_pos"].remove("")
        except:
            pass

        tmpSTR = ""
        for i in range(0, len(inputDICT["result_pos"])):
            tmpSTR = tmpSTR + re.sub(posPat, "<DROIDTOWN_TKBD>", inputDICT["result_pos"][i])
            tmpSTR = tmpSTR.replace("<DROIDTOWN_TKBD><DROIDTOWN_TKBD>", "/").replace("<DROIDTOWN_TKBD> <DROIDTOWN_TKBD>", "/ /").replace("<DROIDTOWN_TKBD>", "/")
        inputDICT["result_segmentation"] = tmpSTR
        return inputDICT

    def _posShift(self, posLIST):
        for i in range (0, len(posLIST)):
            if len(posLIST[i]) == 1:
                pass
            else:
                for pat in self.shiftRule:
                    shiftLIST = [(g.start(), g.end(), g.group(0)) for g in reversed(list(pat[0].finditer(posLIST[i])))]
                    for s in shiftLIST:
                        adjustedSTR = s[2]
                        for adjust_s in pat[1]:
                            adjustedSTR = adjustedSTR.replace(adjust_s, pat[2][pat[1].index(adjust_s)])
                        posLIST[i] = "{}{}{}".format(posLIST[i][:s[0]], adjustedSTR, posLIST[i][s[1]:])
        return posLIST

    def _pos2Seg(self, posLIST):
        resultSTR = ""
        for s in posLIST:
            resultSTR = resultSTR + re.sub(self.purgePat, "╱", s)
        return resultSTR

    def parse(self, inputSTR, level="lv2", userDefinedDictFILE=None, convert=None):
        for i in self.legacyLIST[0]:
            inputSTR = inputSTR.replace(i, self.legacyLIST[1][self.legacyLIST[0].index(i)])

        if level=="lv3":
            tgLV = "lv3"
            level = "lv2"
            if convert == None:
                convert = "TL"
            else:
                if convert.upper() in ("TL", "POJ", "WORD"):
                    convert = convert.upper()
                else:
                    raise
        else:
            tgLV = level

        if platform.system() == "Windows":
            self.TaigiDictFILE = tempfile.NamedTemporaryFile(mode="w+", delete=False)
        else:
            self.TaigiDictFILE = tempfile.NamedTemporaryFile(mode="w+")

        self.userDefinedDICT = self.defaultDICT
        if userDefinedDictFILE == None:
            pass
        else:
            with open(userDefinedDictFILE, encoding="utf-8") as f:
                userDefinedDICT = json.load(f)
            for k in userDefinedDICT.keys():
                try:
                    tmpLIST = userDefinedDICT[k]
                    for POS in self.defaultDICT.keys():
                        self.defaultDICT[POS] = list(set(self.defaultDICT[POS])-set(tmpLIST))
                    if k in self.userDefinedDICT.keys():
                        tmpLIST.extend(self.userDefinedDICT[k])
                    tmpLIST = list(set(tmpLIST))
                    self.userDefinedDICT[k].extend(tmpLIST)
                except KeyError:
                    self.userDefinedDICT[k] = tmpLIST

        #<利用 Articut 建立人名字典>
        checkingPersonDICT = self.articut.parse(inputSTR, level="lv1")
        personLIST = [p[-1] for p in [e[-1] for e in self.articut.getPersonLIST(checkingPersonDICT,  includePronounBOOL=False) if e != []] if p!=[]]
        if personLIST != []:
            self.userDefinedDICT["ENTITY_person"] = [p for p in personLIST if p[0] not in "伊毋" and p[-1] not in "舅叔嬸嫂婆爺爹娘父公爸母某翁姊姐妹兄弟字門梯鄉塗"]

        #</利用 Articut 建立人名字典>

        json.dump(self.userDefinedDICT, self.TaigiDictFILE)
        self.TaigiDictFILE.flush()

        self._mixedInputDetector(inputSTR)
        articutResultDICT = self.articut.parse(inputSTR, level=level, userDefinedDictFILE=self.TaigiDictFILE.name)
        articutResultDICT = self._spaceWalker(articutResultDICT)
        POScandidateLIST = []
        for tkn in articutResultDICT["result_segmentation"].split("/"):
            for k in self.userDefinedDICT.keys():
                if tkn in self.userDefinedDICT[k]:
                    POScandidateLIST.append(("<UserDefined>{}</UserDefined>".format(tkn), "<{0}>{1}</{0}>".format(k, tkn)))

        for i, s in enumerate(articutResultDICT["result_pos"]):
            for p in POScandidateLIST:
                articutResultDICT["result_pos"][i] = articutResultDICT["result_pos"][i].replace(p[0],p[1])
        print("src", articutResultDICT["result_pos"])
        articutResultDICT["result_pos"] = self._posShift(articutResultDICT["result_pos"])
        articutResultDICT["result_obj"] = self._pos2Obj(articutResultDICT["result_pos"])
        articutResultDICT["result_segmentation"] = self._pos2Seg(articutResultDICT["result_pos"])

        if tgLV in ("lv1", "lv2"):
            return articutResultDICT
        elif tgLV == "lv3":
            resultDICT = {"person": self.articut.getPersonLIST(articutResultDICT),
                          #"event": articutResultDICT["event"],
                          "time": self.articut.getTimeLIST(articutResultDICT),
                          "site": self.articut.getLocationStemLIST(articutResultDICT),
                          "entity":  self.articut.getNounStemLIST(articutResultDICT),
                          #"number": articutResultDICT["number"],
                          #"user_defined": articutResultDICT["user_defined"],
                          "utterance": [],
                          #"input": articutResultDICT["input"],
                          #"unit": articutResultDICT["unit"],
                          "exec_time": articutResultDICT["exec_time"],
                          "level": "lv3",
                          "version": articutResultDICT["version"],
                          "status": articutResultDICT["status"],
                          "msg": articutResultDICT["msg"],
                          "word_count_balance": articutResultDICT["word_count_balance"],
                          }
            # 呼叫一個 converter，把 resultDICT["result_obj"] 裡的詞彙一個一個轉成拼音。
            if convert == "TL":
                resultLIST = self._2TL(articutResultDICT["result_obj"])
            #elif convert == "POJ":
                #resultLIST = self._2POJ(articutResultDICT["result_obj"])
            #else: #convert == "WORD":
                #resultLIST = self._2Word(articutResultDICT["result_obj"])
            resultDICT["utterance"] = "╱".join(resultLIST)
            return resultDICT



if __name__ == "__main__":
    try:
        with open("../account.info", encoding="utf-8") as jF:
            accountDICT = json.load(jF)
    except:
        accountDICT = {"username":"", "apikey":""}

    accountDICT = {"username":accountDICT["username"], "apikey":accountDICT["apikey"]}
    articutTaigi = ArticutTG(username=accountDICT["username"], apikey=accountDICT["apikey"])
    #台語漢字 CWS/POS TEST
    inputSTR = "你ē-sái請ta̍k-ke提供字句hō͘你做這個試驗。"
    inputSTR = "跋倒, 佮意"
    inputSTR = "伊誠𠢕激五仁，激甲逐家笑咍咍".replace("。", "")

    inputLIST = [
        #"你愛有出脫人才會看你有",
        #"伊食到七十外矣，猶閣是紅膏赤蠘",
        #'伊嫌\ue701翁頇顢講話,',
        #"除非你加入，伊才肯共阮鬥相共",
        #"伊提錢欲共警察楔空，警察顛倒共罰較濟錢",
        #"李家明仔載欲來捾定，咱著辦腥臊請人",
        #"雖然我佮恁阿爸平歲，毋過論輩無論歲，咱算仝沿的，叫我阿兄就好",
        #"今仔日誠好日，幾若口灶咧嫁娶",
        #"借問一下，文化路佇佗位？",

        "車斗有張升降尾門，較好起落貨",

        "一人才分一疕仔，連楔喙齒縫都無夠",

        "錢大百，人落肉",

        "你有夠戇，連好歹人都分袂出來",

        "在生食一粒塗豆，較贏死了拜一个豬頭",

        "火車敗馬去，死傷真濟人",

        "選舉的時，候選人定會予對頭陣營的人放紙虎，致使影響著伊的選情",

        "兩角找五分，覺悟。這是一句孽譎仔話",

        "伊生做斯文斯文，真有內涵的款，毋過一下開喙就破功矣",

        "毋知影是啥物原因，我感覺筋節痠軟",

        "我手裡有物件，干焦會當共你行注目禮",

        "伊真有福氣，後生新婦攏誠有孝",
        "你身軀紮遐濟錢，毋通現出來予人看著",

        "伊生成較懶性，若無較捷共迫促咧，工課進度會去予誤著",

        "投票的時，若無紮印仔，會使簽名抑是頓指模",

        "咱人三月二三是媽祖生，臺灣逐所在攏有人咧迎媽祖",

        "醫生共聽筒囥佇我的胸坎，聽看我的肺部有各樣無",
        "提起來漉漉咧，聽看內底是啥",
        "彼塊雞卵糕軟㽎㽎，誠好食！",
        "伊偷提厝裡的錢，予阿公縛咧，啥人敢共伊敨放？",
        "毋拄好共伊挨著，按呢就袂直矣",
        "廟口咧大拜拜，咱來去鬥鬧熱",
        "這件代誌若是傳出去，會真歹聽",
        "有也好，無也好",
        "無認真，以後就毋成物",
        "伊身命荏，需要調養",
        "予槌仔摁著，會著內傷",
        "自彼工了後，伊就毋捌閣再提起彼層代誌矣",
        "我閣較衰䆀，嘛袂去揣伊鬥相共",
        "你會有這款心理，實在予人想袂到",
        "聽候鼎熱的時，才下油落去炒",
        "衫澹去矣，緊褪起來",
        "手曲，屈入無屈出",
        "伊泡茶，著用茶洗洗茶甌，有夠工夫",
        "伊做伊行，我做我行",
        "這是好的，彼是歹的",
        "伊按呢做根本就是「一隻牛剝雙重皮」，實在誠可惡！",
        "規間厝暗摸摸，你哪會毋開電火？",
        "兩个無相捌，咱來介紹予熟似",
        "明仔暗會停電，你敢有攢手電仔？",
        "空喙閣流血矣，足疼的",
        "見若拜六，伊就走去踮沬",
        "傷過光，倒鑿目",
        "這盤雞肉半生熟，毋通食",
        "你問我的代誌我攏毋知，你去問別人",
        "你就是種著恁老爸，才會遮緣投",
        "彼个貧惰骨，日頭曝尻川矣閣毋起來",
        "你寒天出門毋穿外套，較加嘛會感冒",
        "你咧寫啥，我攏看無",
        "春天後母面，欲變一時間",
        "家己若袂生，會使去分別人的囡仔來飼",
        "差豬差狗，不如家己走",
        "伊欲按呢做，我嘛無法度",
        "三噸半的貨車扣除車身重量，會使載大約一千五百公斤的貨",
        "無某無猴，穿衫破肩胛頭",
        "伊佇內底，你共伊喊一下",
        "遮爾重要的物件竟然無紮，你實在有夠散形",
        "靠勢伊是大官虎，食人夠夠",
        "好佳哉有你替我求情，若無，我就慘矣",
        "食老，變相",
        "年節時仔，庄頭做戲的錢攏是規庄頭公開的",
        "外口咧落雨，等雨停才來去",
        "伊無聲無說行入來，害我驚一趒",
        "下早仔的生理真好，我早早就收擔矣！",
        "阿榮伯上過謙，對人有夠客氣",
        "落雨矣，攑雨傘來遮閘一下",
        "教會佇老母日攏會準備剪絨仔花，予會友結佇胸前",
        "伊四季攏穿仝款衫，敢若毋知寒熱",
        "伊按呢共人漩，實在有夠無水準！",
        "伊拍拚幾若年矣，仝款無啥物作為",
        "你𤆬頭，我綴你後壁行",
        "伊起彼間厝，去侵著別人的地界",
        "我約伊今仔日中晝佇公園會合，做伙去看櫻花",
        "趁閬雨縫，我欲先來去矣",
        "搖人無才，搖豬無刣",
        "伊足興酒的，較無興跋",
        "七少年八少年就著這款死症，可憐！",
        "你趖跤趖手，排路邊擔仔無合啦",
        "順天者存，逆天者亡",
        "阿英真好命，囝孫攏足有孝",
        "伊今年傷放蕩，予先生共伊落第",
        "彼粒王梨已經流湯矣，緊提去擲掉",
        "價數若落，囤貨就無盤",
        "伊的個性較孤獨，無咧佮人相交插",
        "是親非是親，非親卻是親",
        "三年一閏，好歹照輪",
        "你若是表現了好，逐家就會共你拍噗仔",
        "你若犯著我，我就對你無客氣！",
        "拄著困難，若袂曉反變，就踅袂過",
        "你毋聽我的話，時到後悔就袂赴矣",
        "伊跤手真緊，穡頭一睏仔就做了矣",
        "彼陣我一个人蹛佇山頂，日子過了真清閒",
        "那行那食物件，實在真歹看相",
        "一下捋，就走縒",
        "伊放火燒人的車，上好去自首",
        "鋪面蟶，浸水蚵",
        "這攤生理若予做會成，就聽好食半世人矣",
        "這个囡仔若賤蟲咧，物件攏予伊耍歹了了",
        "樹仔是實腹的，無親像竹仔是空殼的",
        "我會曉彈琴，袂曉看譜",
        "嘉南平原的塗肉厚，足好種作",
        "你嘛毋通遐孤佬，諒情一下也無通",
        "伊真勥，逐家攏真呵咾",
        "你看著面熟面熟，咱敢捌相見過？",
        "我這禮拜為著伊的代誌，無眠閣損神",
        "舊底阮無熟似，舊年才相捌",
        "運氣若到，擋都擋袂牢",
        "我毋捌向咧揉塗跤，揉無一時仔就腰痠背疼",
        "你都大人大種矣，閣遮擂槌",
        "你只不過是一个半桶師仔，有啥物好囂俳的？",
        "這擺市內做大水，損失誠嚴重",
        "彼間店當咧摒貨底，咱下暗有閒做伙來去看覓",
        "伊有夠惜皮，一空仔囝爾爾就哀甲大細聲",
        "阿福伯的喪事是午時弔祭，申時落葬",
        "伊規个家伙攏予人拐了了，實在有夠克虧",
        "大道公風，媽祖婆雨",
        "阮當咧趕路，無時間通歇睏",
        "好囝毋免濟，濟囝餓死爸",
        "這件代誌，伊完全毋知",
        "母身若顧予伊好，囡仔出世就較健康",
        "耕者自耕，讀者自讀",
        "頷頸生瘤，拄著矣",
        "阿足仔誠惜囝，連小可代誌嘛毋甘予囝做",
        "你傷過主動啦，伊會歹勢",
        "無論我按怎苦勸，伊就是袂醒悟",
        "手捾茶籗六角扁，緊緊捾來身軀邊",
        "這个囡仔真健丟，閣會曉拋麒麟",
        "為著維護空氣的品質，車廂內全面禁薰",
        "拄著危險，伊攏走代先",
        "伊無細膩甌仔捙倒，煞予燒茶燙著",
        "時機䆀䆀，我的錢水有較乏",
        "彼个人鬼頭鬼腦，逐工都想空想縫欲食人",
        "做彼款生理，毋是趁大錢，就是了大注",
        "你有夠儑面，遐爾懸曷敢跳落去",
        "你最近面色誠䆀，敢是身體佗位有各樣，你無智覺著是毋？",
        "工課做了，心規个攏清起來",
        "我較頇顢，請你小可讓手咧！",
        "風雨快過，言語僫化",
        "你歹𤆬頭，專門咧教歹囡仔大細",
        "是拄搪予我看著，我才知影的",
        "選舉的時，定定有候選人出漚步，欲共對手抹烏",
        "雞屎落塗，也有三寸煙",
        "伊佇閘屏後面換衫，你毋通過去",
        "我當天咒誓，絕對無騙你",
        "彼號代誌若去予人點破，你會足落氣的",
        "伊雄雄走出來，我險險共伊挵著",
        "有樣看樣，無樣家己想",
        "塗跤彼堆炭屎燒猶未過，你毋通去踏著",
        "共袂食得的菜葉仔揀掉，提去漚肥",
        "鹽甕仔生蟲，無可能",
        "伊遐爾跤梢，佮人袂比得",
        "兜真散赤，攏毋捌看伊穿一軀新衫",
        "初三四，月眉意",
        "伊行路跋倒，頭去磕著",
        "這个囡仔真好喙，看著人客來，攏會共人叫",
        "做人若傷計較得失，日子會足歹過",
        "有心拍石，石成穿",
        "醫生看伊攏直目去矣，嘛無放棄，繼續共伊急救",
        "伊真有情，搬去遐久矣，閣會定定來相揣",
        "無閒遮久矣，你著好好仔歇睏",
        "伊真有才調，律師牌一擺就考過！",
        "我對正面共伊看，才發現伊生做真媠",
        "空殼厝拄才起好，猶未成格，袂蹛得",
        "未曾做就勼手，實在無路用",
        "這擺的投資失敗，規个家伙攏臭焦去矣",
        "檨仔釘點矣，緊食食咧",
        "天氣傷寒，一寡菜凍霜攏袂收成得",
        "伊人無爽快，行路會蹁",
        "伊咧問你，你攏無回答",
        "請你閣予我寬限一個月，時到我一定會共錢還你",
        "阮出外人手面趁食，逐日著做粗工來度三頓",
        "你先叫菜，我隨來！",
        "伊是一个相諍毋認輸，相輸閣毋捌贏的人",
        "你毋轉去食暗，是欲閣去佗位樂跎？",
        "請逐家隨意，毋通拘禮",
        "較早睏，較有眠",
        "佇遠遠的所在，就看會著臺中火力發電廠彼四支煙筒管矣",
        "阿滿仔，你當時欲娶新婦？",
        "檢方挽瓜揫藤，將所有的嫌犯攏㨑著，才做一睏總共起訴",
        "雨落遮大，伊閣一直犁去",
        "伊是靠老爸，才有今仔日",
        "坐竹雞仔車雖然較俗，毋過較無保險",
        "你代誌舞到這款地步，才予我來收尾，敢袂傷超過？",
        "伊的人就是一條腸仔迵尻川，無啥物心機",
        "伊咧起性地，你小共伊安慰一下",
        "大通路的十字路頭，一般攏有電眼咧翕",
        "會得過日就好矣，毋免欣羨別人好額",
        "拄才猶咧出日頭，這馬煞咧反天矣",
        "阮厝頭家人誠好，定定共阮鬥相共",
        "你若閣背約，伊就毋佮你合作矣",
        "伊無遵照契約，去予人消定矣",
        "這是要緊的契約，你毋通拆破",
        "古早時代，「玉井」叫做「噍吧哖」",
        "豬跤𤉙爛爛，真好食",
        "我叫是你欲走矣，毋才無共你招",
        "這本冊的內容真淺，囡仔人嘛看有",
        "椅仔排無好勢，看著真亂",
        "伊喙齒疼，哼規暝攏無睏",
        "一个囡仔疕，閣足𠢕變鬼變怪",
        "伊駛車去共人挵著，煞做伊閬港，好佳哉尾仔有佮人和解，法官才予伊寄罪",
        "你按呢拚性命做，身體敢會堪得？",
        "刀對心臟揬落去，連鞭就好勢矣",
        "這改風颱，害阿伯的田園予大水流去矣",
        "伊違反規定，去予主辦單位除名矣",
        "寬寬仔是就好，毋免趕",
        "有囡仔佇身軀邊纏跤絆手，做無工課",
        "這聲慘矣，予你害一下連我嘛著災矣",
        "囡仔攏出外，兩个老的感覺真稀微",
        "你閣按怎不滿，嘛毋免走對我遮來頓椅頓桌",
        "玻璃摔落塗跤，就去了了矣",
        "連這款夭壽代你都敢做，敢毋驚會促歲壽？",
        "散會的時，阮有攢三、四百塊王梨酥，佇大門口送予人客",
        "這明明是滸苔，你硬欲死諍是頭毛菜",
        "伊做人痟痟，真好鬥陣",
        "伊親像大肚胿，一頓會當食六碗飯",
        "最近咧落𤺪雨，衫仔褲披較久都袂焦",
        "食藥仔會當止疼，毋過嘛有副作用",
        "我去清田溝，無細膩煞落湳",
        "阿琴仔家己一个養飼幼囝，實在足感心",
        "元宵節的時，南北二路的人攏來看「臺灣燈會」",
        "彼台冷氣攏袂涼，有開無開無精差",
        "咱蹛這角圍仔，山勢較低",
        "石頭傷大粒，著用鐵撬才撬會起來",
        "湯拄𣁳起來爾爾，猶燒滾滾，毋好燙著",
        "天氣傷冷，跤攏必開矣",
        "伊本來食菜，最近決定欲開臊",
        "總統若出門，身軀邊一定有保鏢",
        "你做代誌著較撙節咧，毋通傷超過",
        "懸崎，車著愛催油才會起去",
        "伊共鼎蓋掀起來，看內面是啥物",
        "這个名真生份，我毋捌聽過",
        "老爸若佇咧，伊就毋敢亂來！",
        "為著欲顧三頓，閣較艱苦嘛毋驚",
        "伊就是歹心行，才會受著報應",
        "毋通頓蹬，緊行！",
        "伊的人面真闊，拜託伊就無毋著！",
        "厚操煩，人快老",
        "緊去洗身軀，洗好通較早去睏",
        "下昏真䆀氣，拍麻雀一直放銃",
        "予兩个去仙拚仙，咱蹛邊仔看戲就好",
        "你坐遐久，緊起來活動一下",
        "當票若無去，你的金鍊仔就提袂轉來矣",
        "食老無效，挖無塗豆",
        "你若叫伊鬥相共，伊後擺一定會共你討人情",
        "你若是有啥物三長兩短，叫我欲按怎活落去？",
        "赤跤逐鹿，穿鞋食肉",
        "你交代的代誌，我已經完成矣",
        "原來你就是王董的，失敬，失敬！",
        "你若看伊做了毋著，著共伊點拄一下",
        "你來寫批囊，其他的代誌我來處理",
        "真拄好，兩个時到位",
        "代誌沓沓滴滴，按怎做都做袂了",
        "欲我，早就佮伊變面矣",
        "你入門我就鼻著你的臭跤液味，緊去共跤洗洗咧！",
        "伊佇外口鬥夥計，某敢攏毋知？",
        "伊賣的貨，正範假範相濫，你毋通予伊唬去",
        "頂日仔阮捌得失伊，伊毋才定定來咧交繃",
        "鳳尾草雖然臭賤，毋過若是熱著的時，共伊煎來做茶啉嘛誠有效",
        "伊佮阿仁原本感情誠好，近來煞為著生理的代誌反目",
        "伊食人夠夠，欠人兩萬箍，干焦還人萬五就欲準拄煞",
        "是毋是，罵家己",
        "毋成猴，閣會考第一名",
        "深坑的豆腐是燃柴煮的，所以較芳",
        "人若肯拍拚，乞食也會出頭天",
        "伊閣咧跋牌仔矣，你叫伊好停睏食飯矣",
        "景氣䆀，生理小收束一下",
        "伊改酒了後，人加真有精神",
        "我聽你咧落下頦，錢明明就是你提的，閣諍無",
        "我欲步輦來去公園𨑨迌，你欲鬥陣來去無？",
        "雖然兜真散赤，毋過的囡仔攏真有出脫",
        "你親像管家婆，逐項代誌都欲管",
        "跤手遮緊，隨予你搩幾若塊去",
        "手䘼傷束，我的手軁袂過",
        "你就是貪人的利息，才會予人倒數",
        "若想著這層代誌，我就火大",
        "像這款大寒的天，食一寡燒的上好",
        "積一寡仔錢，以後就用會著",
        "嘿啊，我知啊",
        "蹔跤步，跤步著和齊",
        "人若長志，就有機會出脫",
        "伊是我的心肝寶貝，啥人都袂使共伊欺負",
        "伊實在有夠破格，代誌予伊沐著就失敗",
        "仙人拍鼓有時錯，跤步踏差啥人無？",
        "彼个部長嚴重失職，煞毋肯落台負責，佇遐咧漚戲拖棚",
        "等咧喜酒食煞，彼陣好朋友欲去弄新娘",
        "遮的香油囥傷久，鼻著臭油餲臭油餲",
        "昨暗走一下傷久，害我今仔日跤牚腿",
        "我都允人矣，袂使反悔",
        "伊生做肥軟仔肥軟，看著蓋古錐",
        "我姑情伊規半工矣，伊毋答應就是毋答應",
        "伊的工課真濟，足無閒的",
        "月圍箍，曝草埔",
        "伊咧修行，無插俗事",
        "燈座傷細，徛袂好勢",
        "伊做人真豪爽，袂沙屑",
        "逐遍若叫你讀冊，你就開始盹龜",
        "窗仔有縫，風攏對遐貫入來",
        "提好，毋通摔破",
        "路頭擔燈心，路尾擔鐵槌",
        "伊做代誌足工夫，真可取",
        "戲台小人生，人生大戲台",
        "這塊碗較深，會使貯較濟湯",
        "若無才調閣硬欲賭強，是會傷害著家己呢！",
        "孤兒的命運，親像葉仔佇水面漂",
        "我臆了無毋著，物件果然是伊提去的",
        "你共烘爐提去外口搧風，按呢火才會較炎",
        "阿菊真擔輸贏，翁欠錢走路，伊家己拍拚趁錢替翁還數",
        "伊真𠢕假仙，你毋通予伊騙去",
        "囡仔摸著烘烘，可能欲感冒矣",
        "聽你咧臭彈，我就毋相信你有佮總統做伙食飯過",
        "是你毋著呢，閣敢來嚷！",
        "伊敢若牛螕咧，欲叫伊出錢是無可能的代誌",
        "我逐工共恁煮飯洗衫，就敢若恁倩的老婆仔咧",
        "熱人蠓仔厚，著用蠓仔薰來趕蠓",
        "立冬燖補，共序大人侹身體",
        "彼兩間便利商店相對相，毋過生理差真濟",
        "今仔日隔壁的門口埕停幾若台高級轎車，毋知有啥物大代誌",
        "你叫做啥物名，我雄雄煞袂記得",
        "海湧有時起，有時落",
        "伊傷貪，才會去予諞仙仔諞去",
        "你就是對人傷無客氣，才會不時咧食膨餅",
        "日本點心甜粅粅，食濟會大箍",
        "拋碇了後，咱就會當落船矣",
        "伊鬼鬼祟祟，毋知閣欲變啥魍矣",
        "落雨了後，田岸路醬醬醬",
        "你佗位無爽快，哪會咧流凊汗？",
        "大人咧處理代誌，囡仔人毋通來鬥鬧熱",
        "有燈塔的指引，船仔才會當平安入港",
        "新的總經理真𠢕轉錢空，順利解決公司的財務危機",
        "厝內若有活水來透，錢的用度就會較冗剩",
        "警察懷疑伊有紮毒品，共伊搜身軀",
        "伊有影長尻川，去人兜坐落去就毋知通起來",
        "洘旱的時陣無水通用，真艱苦",
        "伊會拍老爸，真反常",
        "千斤重擔有人擔，辛苦病疼無人擔",
        "兄弟仔定定正面衝突，冤家量債",
        "我共你使目尾，你攏無共我看",
        "冰箱內底的菜已經烏漚去矣，緊提去擲掉！",
        "東部營業處後個月月初起磅，逐家加油！",
        "伊欠人一筆數，這馬才咧四界傱錢",
        "看你按呢氣怫怫，是為著啥物代誌？",
        "這个囡仔誠硬氣，以後一定有出脫",
        "這擺的代誌做了無啥順利，才會去予人碰釘",
        "你真正有夠低路，連這款工課都袂曉做",
        "伊專門拐弄人的囡仔去做賊仔，誠歹心！",
        "人若淺緣，就袂深交",
        "工課若著頭，就會真順序",
        "過年時仔，街仔路人洘秫秫",
        "你遮爾鈍，欲按怎做生理？",
        "今仔日誠好日，幾若口灶咧嫁娶",
        "伊正經工課毋做，規日就佇遐變猴弄",
        "死矣，錢無去矣",
        "看著伊彼个死人面，我就受氣",
        "三工傷趕矣，交袂出來",
        "現代網路方便進步，有足濟人是佇面冊頂懸佮人相捌、盤撋",
        "無，恁兩个相換好矣，伊徛頭前，你徛後壁",
        "阮翁差不多暗頭仔就會轉來，你閣等一下",
        "無錢，做你共我提",
        "落雨矣，緊共雨傘褫開",
        "兄弟若仝心，烏塗變成金",
        "頭家人真好，我一半日仔無去，伊嘛袂按怎",
        "無錢毋通假大範，才袂予人吊猴",
        "鹽酸仔足臭賤的，真𠢕生湠",
        "少年的，你著聽老歲仔苦勸",
        "一陣春風吹來，予人感覺誠清彩",
        "伊有一个大肚胿，做啥物代誌攏真無方便",
        "羅漢跤仔四界流，流到南洋去",
        "我頂禮拜問你的問題，你當時會當回覆我？",
        "正經叫伊來，伊毋來！",
        "你做你大伐行，攏無欲等我！",
        "提親進前，逐家攏會去探對方的門風",
        "新正年頭，規个社會充滿快樂的氣氛",
        "遮四面攏是山，環境真好",
        "逐家先品予伊好，等咧欲耍的時毋通呸面",
        "伊逐工食飽睏，睏飽食，真正是一个閒人",
        "你毋通掛意，我會趕緊轉來",
        "囡仔大漢了後，序大人就較清心",
        "時機䆀䆀，錢愈趁愈少",
        "工課到睏尾，人雖然誠忝，嘛是袂使凊彩做做咧",
        "你遮大漢，欺負細漢的敢有𠢕？",
        "你做按呢就會使矣，毋免閣加工啦！",
        "伊是讓你，毋是驚你，你毋通軟塗深掘喔！",
        "你窗仔門關無好，風攏對空縫吹入來矣！",
        "歲頭遐濟矣，閣遮爾歹性地",
        "兩人相尋，真久攏毋分開",
        "請你手梳攑懸，原諒伊這遍的不是",
        "初見面，請你多多指教",
        "你免聳鬚，連鞭警察就來矣",
        "伊一世人勤儉，食老日子才會遮好過",
        "這塊杯仔有必痕，毋通閣用矣",
        "伊無寫功課，去予老師罰徛",
        "你遮爾驚死，是欲按怎做代誌？",
        "伊干焦一身人爾爾，無長半項",
        "歹瓜厚子，歹人厚言語",
        "毋是雙，就是奇",
        "伊這个人歹積德，後擺無好尾",
        "我毋是本地人，我是外位搬來的",
        "佇代誌猶未查清楚進前，咱逐家攏有嫌疑",
        "千算萬算，毋值天一劃",
        "已經害去矣，閣哭嘛無較縒",
        "疑人，毋成賊",
        "番薯囥咧予伊收水了後，食著較甜",
        "帶念你較早攏真認真做工課，這擺就原諒你",
        "看都好好人，哪會定定咧揣醫生？",
        "開喙就𧮙，有夠無品",
        "車咧欲開矣，你若無較緊咧就袂赴矣",
        "伊真好量，人對伊歹聲嗽，伊嘛袂抾恨",
        "官司來到尾站，較輸面的使倒頭槌，提出新證據，勢面反輾轉，倒贏",
        "咱廟裡做醮的紅龜粿，每一口灶分一个",
        "伊駛車佇臺北佮人相舂，這馬咧等警察去處理",
        "一直向前行，毋免轉斡",
        "天地遐爾仔大，免驚無所在通去",
        "田園若有收，鳥隻食得偌？",
        "我若毋是欠錢，哪著行當店？",
        "了錢無打緊，閣會害著別人",
        "伊順從爸母的意思，出國讀冊",
        "借問一下，文化路佇佗位？",
        "你頭拄仔敲電話來的時，我拄咧洗身軀",
        "伊若閣軟塗深掘，我就欲予伊好看",
        "代誌會成袂成，介在你欲做毋做",
        "生不帶來，死不帶去",
        "伊彼號豬哥性，看著媠查某囡仔就流豬哥瀾",
        "頭家，這敢猶閣有別款的？",
        "彼堆火欲化去矣，你緊去提火夾來挓火",
        "阿國仔足豬哥神的，看著媠查某喙瀾就直直流",
        "欲完成這條高速鐵路，著閣坉錢",
        "這種代誌，你毋通予彼个放送頭知影，若無，規庄仔內的人就隨攏知矣！",
        "欲走矣，緊追！",
        "伊是好意欲共你鬥相共，結果煞予你罵",
        "看人咧蹛洋樓，你敢袂欣羨？",
        "伊欠錢毋還，我提伊的跤踏車來拄",
        "彼个頭家蓋惡質，工廠刁工放予倒，家己走去外國享受",
        "看伊規日憂悶，我心內嘛真艱苦",
        "彼堵壁斜去，強欲倒落去矣",
        "朋友有代誌來央託，伊若做會到的，攏毋捌共人推捒",
        "寫甲遐爾細字，你敢看有？",
        "伊按呢共你訕潲，你敢袂艱苦？",
        "伊做伊走，放我佇遮沐沐泅",
        "老大人腸仔無力，有時會滲屎",
        "伊無張持喝一聲，逐家攏驚一趒",
        "伊送去病院進前，就無氣矣",
        "伊是阮這搭的霸王，無人敢得失伊",
        "落水平平沉，全無重頭輕",
        "警察掠著的是人頭，毋是真正的頭家",
        "你這隻暗光鳥，三更半暝矣猶毋睏",
        "關公攑關刀，過五關，斬六將",
        "閣過一个青紅燈，就會當看著兜",
        "紅尾冬，較贏食赤鯮",
        "袂曉啉酒閣啉並濟的，這馬咧茫矣乎？",
        "代先明呼明唱，才袂後日仔毋認數",
        "有當時仔食一屑仔鹹梅，會幫助消化",
        "這領衫袂當囥洗衫機洗，你去用手浞浞咧",
        "貓的奸臣，鬍的不仁",
        "你這个袂見笑的，竟然敢閣來揣我",
        "阮阿兄娶某的時陣，阮兜是家己開桌請人",
        "伊有今仔日的下場，我早就料算著矣",
        "欠錢毋還，我欲提你的翕相機來拄數",
        "恁彼个同事無，姓張的",
        "伊真有風度，共對頭恭喜",
        "伊逐改送禮，攏是大出手，毋是大鮑魚就是高麗參",
        "看起來是大姊較巧神，小妹較頇顢",
        "知影家己毋著，頭隨頕低落來",
        "平平是人，生活哪會差遐濟？",
        "阮阿公過身，打桶兩禮拜才出山",
        "若無經過這擺的考驗，你永遠袂出脫",
        "伊當咧大，一頓摁著三四碗飯",
        "偷提物件予警察掠著，有夠註死！",
        "伊做著涼勢涼勢，別人來做就無遐熟手！",
        "煞戲了後，我就送你轉去",
        "我叫阮囝共我鬥顧擔，伊煞閬港去佮人撞球",
        "這領是舒被，彼領予你蓋",
        "準做天反地亂，你嘛袂用得烏白來",
        "考了䆀，免佇遐喘大氣，趕緊用功，才有機會補救",
        "做粗工食體力，到食飯的時，腹肚就足枵燥矣",
        "人若有歲，身體就會開始厚毛病",
        "厝內當咧摒掃，恁毋通佇遐傱來傱去",
        "四月芒種雨，六月火燒埔",
        "船到碼頭，逐家攏準備欲落船",
        "我來捀碗共你貯飯，你閣小等一下",
        "伊受著老師的感化了後，就變乖矣",
        "你咧痟，我無欲綴你痟",
        "連鞭寒，連鞭熱，蜂蝦生真少",
        "明仔載免上班，會使穩心仔睏",
        "你照我的話做，保證你萬無一失",
        "人硩番薯拋過溝，咱硩番薯毋落頭",
        "彼堵壁足垃圾，你毋通並佇遐",
        "你按呢一直逃避，嘛毋是辦法",
        "蔗尾拍結做號頭，千萬毋通敨",
        "這間厝傷淺，袂當做生理",
        "伊遐爾仔少歲就來過身，實在予人想袂到",
        "頭家猶未來，咱慢且決定",
        "伊予人看破跤手矣，無人會閣再相信伊",
        "弓蕉無到分，食著末末",
        "你雄雄喝一聲，囡仔煞著驚！",
        "一旦地動，彼間厝就會倒",
        "看命無褒，食水都無",
        "伊最近無笑容，敢若有心事咧",
        "伊大箍把是好看頭，身體其實無通好",
        "我都毋去矣，伊閣較無可能去",
        "我欲食炒飯，你咧？",
        "你順這條路直直去，就會看著車站矣",
        "你拍五筒，我就到矣！",
        "已經變紅燈矣，閣硬衝過",
        "伊便若坐車，就會眩車",
        "伊規年迵天攏佇深山林內燒瓷仔，罕得轉來一逝",
        "車囥佇外口，落雨了後煞卡一沿水鉎",
        "老的老步定，少年的較懂嚇",
        "囡仔若破病，做老母的人總是會慒心",
        "這項代誌誠要緊，你緊呼請南北二路眾兄弟過來。 ",
        "頭殼挲尖尖，專門咧鑽",
        "較早若選舉伊攏共人扛轎，這擺伊欲家己出來選",
        "伊真殘忍，不時拍貓、拍狗",
        "啊都伊毋來，阮才會欠一个人",
        "彼个人規身軀癩爛癆，無人敢倚去伊遐",
        "好代毋通知，歹代直直來交纏",
        "菜市仔內，人密密是",
        "去大賣辦貨是用割價，有較俗",
        "囡仔人顧耍，連飯都毋食",
        "伊駛車進前有啉燒酒閣駛傷緊，才會發生車禍",
        "去外埠頭趁食，著較保重咧",
        "無，你是咧畫符仔是無？",
        "恁查某囝會對你大細聲，攏是你共伊寵倖的！",
        "彼條路傷狹，轎車無法度通過",
        "天然的璇石無濟又閣歹挖，所以真貴氣",
        "有的物件好趁，有的末趁，掠長補短生理猶會做得。 ",
        "阮先行，恁押後",
        "昨暗聽伊痚規暝，我實在真毋甘",
        "對今仔日起，咱就是翁仔某矣",
        "彼个囡仔黃酸黃酸，敢若飼袂啥會大漢",
        "翁佇外口有查某，伊攏無智覺著",
        "伊這站仔當咧落衰，逐項代誌都做袂順",
        "外才䆀，內才好",
        "你閣加疊一寡錢，這項物件就賣你",
        "這个庄頭無偌大，蹛無幾口灶",
        "我這陣拄好無散票，大張的予你找敢好？",
        "伊有孝大家官閣𠢕扞家，真是一个賢慧的查某人",
        "沓沓仔來，免趕緊",
        "伊誠將才，為國家計畫足濟代誌",
        "為著趁一屑仔錢，老命險無去",
        "你小扶挺一下，我來共固定予在",
        "阿母洗碗的時，盤仔煞遛手摔破去",
        "真歹勢，我欲勞煩你替我走一逝",
        "伊拍球傷出力，手骨煞脫輪",
        "伊的性敢若阿斗，予人袂扶得",
        "外地的朋友來相揣，我𤆬伊出去附近四界蹓蹓咧",
        "我共伊使目箭，伊就恬去矣",
        "這遍佳哉有你鬥幫贊，實在真多謝！",
        "你著較拍拚咧，毋通做了尾仔囝",
        "氣溫降低，人的血管會收縮",
        "真久無見面矣，高夫人最近好無？",
        "曷無咧半遂，著閣人扛！",
        "欲答應毋答應是出在你的意思，我袂共你干涉",
        "一日徙栽，三日徛黃",
        "食茶練痟話，消遣拍抐涼",
        "這條路彎來斡去，真歹駛",
        "我是放目，毋是無看見",
        "厝場好不如肚腸好，墳地好不如心地好",
        "洗藕粉，著等藕粉坐底",
        "伊做代誌傷死板，袂曉通變竅",
        "機器有佗位仔走縒，才袂振動",
        "伊是孤囝，煞猶未娶某就過身，兜就按呢無傳",
        "彼攏是謠言，你毋通相信",
        "欲按怎做，我心內有譜",
        "枕頭囊全油垢，剝起來洗洗咧",
        "伊倒手真𠢕畫圖，換手就畫袂媠矣",
        "伊出來選立委的時，有真濟好名聲的人共伊徛台",
        "人若有歲閣孤獨，人會叫伊老孤𣮈",
        "伊真為家己人，所以遐的細的攏足敬重伊",
        "欲拜託伊辦，也著前金，也著後謝",
        "你入來的時，紲手關門",
        "乖孫，過來阿媽遮",
        "日月潭的景色袂䆀，有閒咱來去行行咧",
        "這味產品是純天然成分煉成的，無透濫一寡有的無的",
        "伊毋是娶某，是予某招的",
        "伊食暗頓的時，攏會嗺一下",
        "這件代誌是頂司揤牢咧，若無早就辦矣",
        "醫生理解的掛慮，徛佇同情的立場，答應共提囡仔",
        "簽字進前，著先看予伊清楚",
        "倚海的所在鹽分重，欲種作是有較困難",
        "彼手機仔都已經有打對折矣，伊閣硬拗，叫店員送伊電池佮配件",
        "明明知影代誌真嚴重，伊嘛是蹽落去",
        "頭前地場較闊，你車開去遐大翻頭，按呢較好轉踅",
        "咱做人求平安就好，毋通痟貪",
        "阮蹛佇內山斗底，交通真無利便",
        "伊慣勢早睏，過九點就毋通閣敲電話予伊",
        "伊共花矸排做一列，予人欣賞",
        "伊不時咒讖別人，無欲檢討家己",
        "我的胸坎實實，人真無爽快",
        "想著這件代誌，我就失眠睏袂去",
        "衫洗久，料身會虛去。 ",
        "梨仔誠厚重，無幾粒就三斤矣",
        "較緊睏！無，虎姑婆欲來矣",
        "送彼做禮物傷料小，恐驚無夠看",
        "藥粕無啥物藥效，會使擲掉矣",
        "物件猶閣好好你就毋挃矣，按呢敢袂傷討債？",
        "你欲出門做你去，囡仔交予我管顧就好",
        "生有時，死有日",
        "這馬景氣無好，較歹過日",
        "雨落遮爾大，我看會淹大水",
        "你的文章寫了真好，會使去投稿矣",
        "伊目睭𥍉𥍉看，向望老母會轉來𤆬伊",
        "彼班搝大索搝贏，逐家攏足歡喜的",
        "頂幫毋是已經修理好矣，哪會閣歹去？",
        "為著身體健康，你上好改薰",
        "伊雖然人生做矮肥矮肥，毋過跤手真扭掠",
        "昨日暗，阿公有託夢予我",
        "阿爸的身材中範中範，看起來袂肥嘛無偌瘦",
        "我人已經共你揣來矣，看你是欲按怎發落？",
        "伊食物件有夠討債，定定賰一半就欲挕捒",
        "伊提錢欲共警察楔空，警察顛倒共罰較濟錢",
        "這阮查某孫，頂禮拜才大學出業",
        "我欲揣校長，勞煩你通報一下",
        "高麗菜先豉鹽才落去炒，食著加真脆",
        "小徙跤咧，人咧摒掃",
        "恁翁真體貼你，真𠢕共你照顧",
        "一兼二顧，摸蜊仔兼洗褲",
        "遮的貨賣完嘛干焦夠工爾爾，也無啥趁",
        "伊根本都毋捌字，哪會曉寫批？",
        "阮搬來下港二十年矣，早就釘根矣",
        "虱目魚的幼骨仔誠濟，你著細膩仔食",
        "這遍的旅遊，費用攏由公司負擔",
        "山路真狹，駛較慢咧",
        "錢是伊欠的，佮我無相干",
        "阮欲走矣，你咧？",
        "這粒菝仔傷𠕇，我咬袂落去",
        "熱人到矣，電風好提出來矣",
        "你等一下，我隨來",
        "受訓了後，逐家會分發去無仝的單位",
        "你若閣為非糝做，別日仔你就會無好死",
        "伊受著枉屈，才四界咧哭呻",
        "頭家，賰的我總貿，你算我較俗咧",
        "伊暗崁足濟外路仔做私奇，無予某知",
        "陳三五娘相𤆬走的故事，佇臺灣真受歡迎",
        "財子壽，難得求",
        "這粒西瓜到分矣，真甜真好食",
        "法律之前，人人平等",
        "伊貸款納袂出來，厝就予人拍賣矣",
        "叫某去趁食，家己做烏龜，真正袂見笑",
        "勢面若䆀，你就緊抽退",
        "佇遐變規晡，毋知伊咧變啥物魍？",
        "天氣遮寒，食火鍋正當時",
        "這本諺語集所收的臺灣話，逐句都仁仁仁",
        "世間人攏真自私，干焦知影顧家己的利益",
        "你若無較乖咧，我就共你掠來拍尻川",
        "予老母為著這件代誌佇遐激心煩惱，實在是太不應該",
        "徛佇尾溜彼个，你敢捌伊？",
        "嬰仔滿月，阿媽真歡喜，備辦雞酒來請親情、厝邊",
        "有誠濟較早的代誌，我攏袂記得矣",
        "這个囡仔欲食毋討趁，有夠了然",
        "步頻欲叫我做編輯的工課，我做無路來",
        "伊真荏身，磕袂著就破病",
        "你做人大兄閣一日到暗佮小弟冤家量債，敢袂歹勢？",
        "食雞，會起家；食鰇魚，生囡仔好育飼",
        "伊今年畢業，這馬當咧揣頭路",
        "公司倒去的代誌，予伊真大的打擊",
        "伊若是欲食毋討趁，後擺就會予人看袂起",
        "月暗暝行路，有人陪伴，就較在膽",
        "伊定定用媠查某囡仔做釣餌，來騙人的錢",
        "查某人做月內的時，若無細膩著著月內風，是會交纏一世人喔！",
        "伊足久無頭路矣，規个人看著死殗殗",
        "伊的人真雜插，啥物代誌都欲管",
        "翁仔某一个虎豹母一个雷公性，毋知按怎鬥陣",
        "下昏我有一个食飯會，無欲轉去食暗矣",
        "伊做人欺貧重富，佇庄仔頭名聲誠䆀",
        "頭興興，尾冷冷",
        "彼个烏心肝的人，早慢會有報應",
        "弓蕉去予風颱掃倒了了，咱著較儼硬咧，重來",
        "這罐芳水較低級，毋是高級貨",
        "遮的物件舊漚舊臭，閣毋甘擲㧒捔",
        "遮爾好的機會，你是閣咧躊躇啥物？",
        "伊足急性的，無像我遐𠢕拖沙",
        "頭仔興興，尾仔冷冷",
        "你小忍耐一下，連鞭就好矣",
        "伊的頭挵著壁，腫一癗",
        "你著較大路咧，毋通遐凍霜",
        "只要有你，代誌就會成功",
        "這个辦法有通，咱就按呢試看覓",
        "伊這站仔誠懶屍，啥物代誌攏無欲做",
        "真罕行，你今仔日哪有閒通來？",
        "伊跋落去山溝，跤骨摔斷去",
        "教囡仔行五子直，會當提升的智力",
        "歹勢，我較柴目，袂記得咱是啥人，咱敢有相捌？",
        "扳予牢，毋通放",
        "咱來比賽射鏢，看啥人較準",
        "伊雄雄傱出來，害我掣一趒",
        "你緊共雨傘展開，無，會沃澹去！",
        "筅黗以後，就準備過年",
        "我是一个出外人，我的故鄉佇臺東",
        "小說人物玉卿嫂就是佇外口飼花眉，心甘情願共伊照顧",
        "兩人偷來暗去，通庄頭的人攏嘛知",
        "這只是暫時過渡，逐家較忍耐咧",
        "伊為著離緣的官司，去旅社掠猴",
        "你做代誌著較安份咧，毋通痟貪軁雞籠",
        "我都猶未食半喙咧，你就捽了了矣！",
        "伊生做人懸漢大，氣力飽，夯的貨自然比人較濟",
        "聽你一工到暗咧誦經，實在有夠𤺪的",
        "阮阿公七十歲大壽的時陣，阮兜有辦桌請人",
        "阮兜捌飼過花眉，歡喜的時就一直叫，若咧唱歌咧",
        "伊戇戇坐佇遐，毋知咧想啥",
        "毋免抄啦，提去影印較緊",
        "若是攏無人欲去，咱就抽鬮來決定",
        "頭拄才洗好，膨獅獅",
        "規間厝搜透透，攏揣無",
        "你就是攏無修行，性地才會遮爾仔䆀",
        "伊雖然生做戇頭戇面，毋過心肝真善良",
        "你真正咧老顛倒矣，昨昏的代誌今仔日就袂記得",
        "愈落伍的國家，楔後手的現象愈普遍",
        "這幾日雨澹水滴，路不時攏𣻸塌塌",
        "這陣的股市行情誠好，伊攢兩千萬，存範欲大抐一下",
        "慢慢仔是，免著急",
        "這支刀有夠鈍，切肉若咧鋸肉",
        "伊做代誌真浮冇，我袂放心",
        "較早踮厝內，大囝的責任較重",
        "規欉好好，無錯",
        "有人咧叫門，你去看是啥物人？",
        "伊早起跋倒，去頓著尻川",
        "這領衫皺皺，你共熨較伸咧",
        "伊雄雄發性地，逐家攏予伊驚著",
        "馬四跤，有時也會著觸",
        "自從離開故鄉，每日思念爸母",
        "代誌若有小可撞突，伊就袂食袂睏矣",
        "你佇遐牛聲馬喉，有夠噪人耳，較細聲咧",
        "阿美翁真靠俗，真好鬥陣",
        "叫你加疊一領衫你就毋，這馬去寒著矣乎！",
        "老爸放予伊的財產，伊無幾年就刜了了矣",
        "伊開始咧陣疼，應該欲生矣",
        "就是有人陷害，伊才會來枉死",
        "人共伊歹，伊毋但毋驚，閣敢佮人㧣",
        "伊一个查某人飼兩个囡仔，雖然艱苦，生活猶會得過",
        "我都合袂拄好，袂當參加這遍的同窗會",
        "人咧叫你，你嘛共人應聲一下",
        "你斟酌一下，應該聽會著",
        "伊拄失戀，逐工攏心慒慒",
        "恁查某囝實在真活動，一直走來走去",
        "頭昏昏，腦鈍鈍",
        "無聊的時陣，就來變工藝",
        "真歹勢，無張持共你挨著",
        "這幾年來，社會一直咧轉變",
        "看這个範勢，無走袂使矣！",
        "我細漢的時，序大人有教我用母語暗唸三字經",
        "予伊掠龍了後，規身軀攏誠爽快",
        "親情有禮數相伨，較會親",
        "你實在是儑頭儑面，伊是頭家的姨仔，你曷敢對伊大細聲",
        "無靠戇膽，哪會敢去啊！",
        "有錢就烏白拍翸，較濟嘛無夠開！",
        "阿達仔是一个佬仔，你毋通予伊騙去",
        "寒著蓋被翕汗，較緊好",
        "頂港有名聲，下港上出名",
        "遮痠遐疼，我身軀已經規組害了了矣",
        "人生在世，毋免傷計較",
        "這馬咧烏陰矣，較停仔無的確會落雨",
        "無伊共你點醒，你較想嘛想袂清楚",
        "毋知這个嬰仔是佗位仔咧袂拄好，騙攏袂恬",
        "你去四箍輾轉揣看覓，看彼个囡仔覕佇佗位？",
        "頭家若較歹咧，伊就較覕鬚",
        "翁規年迵天佇外面走傱，伊只有孤單守空房",
        "遮人真濟，你毋通蹛遮拋麒麟",
        "蓮藕粉摻糖煡煡咧，真好食",
        "伊逐擺攏欲佮人相諍，毋過無一擺諍贏",
        "無喙齒，只好沓沓仔卯",
        "這起命案，警方真無簡單才揣著被害者的死體",
        "家族的查埔囡仔有照字勻號名，查某囡仔無",
        "伊猶閣少年，向望你共伊牽成",
        "你按呢對待伊，你的心肝敢會得過？",
        "這項物件你小共我看一下，我連鞭就轉來",
        "伊的修養真好，攏袂佮人冤家",
        "身體有走縒，才袂食飯",
        "火舌湠去誠緊，一目𥍉仔就共厝燒了了矣",
        "你這个垃圾鬼，一軀衫穿規禮拜攏無欲洗",
        "伊對我的感情若有若無，害我定定失眠",
        "等物僫到，等人快老",
        "是袂䆀啦，毋過交通有較無利便",
        "兩个佇街仔路相唚，予老師看著",
        "伊睏癖真䆀，規暝反來反去",
        "我做代誌真頇顢，你就加共我差教咧",
        "你若是有心欲做，就一定會成功",
        "財子壽，三字全",
        "大摒掃的時，天篷嘛著清清咧",
        "老母反對來往，伊煞來病相思",
        "伊這改是堅心欲拍拚，無成功就毋轉去故鄉",
        "免趕緊，沓沓仔來就好",
        "稻仔飽漿，今年一定大收",
        "這个囡仔誠蠻皮，無論你按怎拍攏袂驚",
        "這桶水圇圇仔，拄仔好會使洗身軀",
        "伊是咱工會的頭兄，對外的重大事件攏央伊出頭處理",
        "伊若真正按呢做，就傷超過矣",
        "這个囡仔敢若猴山仔，真無定著",
        "你逐工食清領便，閣有啥物好煩惱的？",
        "藥頭仔煎好，藥渣留咧會使閣煎一擺",
        "紅豆做紅豆囥，綠豆做綠豆囥",
        "米洗無清氣的款，飯食著沙沙",
        "你姓陳，是無？",
        "我的鞋仔內底敢若有石頭仔，感覺砧砧",
        "今仔日烏陰天，你上好紮雨傘出門較穩當",
        "經過一個月了後，伊才追認囝結婚的事實",
        "擔屎的，臭尾後",
        "你共雨幔囥蹛車斗，落雨天就會使幔咧騎車",
        "你無做毋著，免驚人投！",
        "伊差一點仔就著獎矣，有夠無彩",
        "逐家攏叫厝主「媽祖婆」，有伊佇咧，絕對袂枵著！",
        "伊欲稅厝，叫我共伊鬥揣",
        "桶仔坐底，袂用得",
        "你毋來，伊就無欲出面矣",
        "人來就好，毋免紮啥物等路啦！",
        "伊揹一个大肚胿，嘛仝款拋拋走",
        "員工受害，走去揣頭家抗議",
        "欲按怎做，等對方條件開出來才便看",
        "原本會贏的比賽煞輸輸去，逐个人攏面漚面臭",
        "你著勻仔是，毋通食緊挵破碗",
        "我的苦勸你若毋聽，就準做我無交你這个朋友",
        "伊彼个人真無量，攏毋肯共人鬥相共",
        "我細漢佮阿媽蹛，伊足疼我的",
        "雖然月給無懸，儉儉仔用猶會當賰淡薄仔",
        "滿街路攏是人，真鬧熱",
        "兩爿咧冤家，一爿看毋是勢，緊閣落人來",
        "我來揀菜，揀好才予你洗",
        "前某對人誠好，予人誠感心",
        "感謝你共我鬥相共，代誌才會遐爾緊就做了",
        "荔枝這陣退時矣，較無水分，也較袂甜",
        "頂晡就出去矣，暗時才會轉來",
        "事業交予後生了後，就是閒身矣",
        "駛車欲行彼條彎曲的路，你著細膩！",
        "你的正手爿有一本冊，提過來予我好無？",
        "人總是會做毋著去，你就大事化小，小事化無，放目諒情伊",
        "僥倖錢，失德了；冤枉錢，跋輸筊",
        "你去共偷眯一下，看伊咧創啥 ?",
        "遮的餅臭殕去矣，毋通食",
        "當咧冤家，你小共排解一下",
        "你這擺會去予刁難，我看可能是伊咧變空",
        "頭拄仔的代誌只是誤會爾爾，希望你會當諒解",
        "若毋是伊食人夠夠，逐家嘛袂佮伊計較",
        "頂司管下司，鋤頭管畚箕",
        "伊外表好看爾爾，無啥物底蒂",
        "食殺，穿拍結",
        "婦人人難產的時，有時陣會血崩山",
        "你直直行，免轉斡就到矣",
        "你若是有心欲做，啥物困難攏會當克服",
        "廟口這陣咧迎鬧熱，咱緊來去看",
        "伊這馬佇你的公司食頭路，請你加共伊扶挺一下",
        "這个人是火烌性，較會得失人",
        "阿忠生做誠懸，人攏叫伊躼跤忠仔",
        "歹勢，閣來恁兜共你攪擾",
        "我袂記得寫功課，毋才會予老師罵",
        "破病的人閣毋知欲忌喙，你實在真害",
        "你昨暝是去做賊仔呢？無，精神哪會遮爾䆀？",
        "無彩拄拄落肥爾爾，隨就做大水",
        "這擺請人客是欲辦桌，抑是欲去食餐廳？",
        "你共物件囥蹛遮，會去予人撞著",
        "頭家，豬肉較好份的切一塊予我",
        "桌頂毋通留餅幼仔，會唌狗蟻",
        "我無這款經驗，請你共我指教",
        "你做人的馬仔，一世人都袂出脫",
        "頭家，這个傷舊，我欲換別个",
        "電視頂懸的字跳咧跳咧，看袂清",
        "做人千萬毋通痟貪，才袂軁雞籠",
        "番薑真薟，食著會凍舌",
        "這个風景區真揜貼，內行的才揣有",
        "枉費我對你付出遮爾仔濟，你一點仔都毋知著感恩",
        "你罰款無繳，會予人吊照",
        "你哪會遐儑，毋知影人咧受氣",
        "藥仔食落去，到今一對時矣",
        "我手尾力無夠，捾袂起來",
        "逐家較鬥搭咧，緊做予煞",
        "伊這站仔因為胃破空手術，當咧蹛院",
        "爸老囝幼，伊真受罪",
        "這是逐家的責任，毋通推來推去",
        "阮頭家會用刣雞教猴的方式管理部下，予人感覺無啥爽快",
        "我揣無路，一直佇這搭踅玲瑯",
        "時機䆀，驚予人刣頭",
        "這件代誌，我是無法度共你掛保險",
        "遮的先留落來，後擺猶有路用",
        "洗身軀間上好開一个窗仔，較通風",
        "伊這擺會感冒，是去予同事染著",
        "火氣傷大，喙脣會必",
        "伊都徛佇你的面頭前矣，你閣無看著",
        "韭菜花炒透抽，真佮喙",
        "無，你這馬是倚靠啥人的勢頭？敢侵門踏戶來亂？",
        "你連這點仔道理都毋捌，較輸一个無讀冊的",
        "天氣誠涼，予我感覺真爽快",
        "你就是傷好命，才會食米毋知影米價",
        "總講一句，是你家己做得來的，毋免去怪別人",
        "前謝五萬，後謝三萬",
        "賣貨頭，卸貨尾",
        "你這馬若無用功讀冊，以後就知艱苦",
        "若欲預防病毒，洗手著用雪文會加較有效",
        "你予我小眯一下，我才陪你去",
        "伊叫我錢借伊，我袂癮",
        "彼个查某囡仔真好禮，叫我坐佇遮",
        "大人無上桌，囡仔人袂使先動箸",
        "這個月是小月，來阮店交關的人客有較少",
        "伊是熟手，你免煩惱",
        "對阮厝到公司，行路一目𥍉仔就到矣",
        "我看著煎粿，一定會叫一盤來食",
        "阿珠人真抾拾，袂烏白開錢",
        "伊偷用公家的錢予頭家發現，就按呢摃破家己的飯碗",
        "逐家相招來弄獅，大鑼大鼓鬧猜猜",
        "倖豬夯灶，倖囝不孝",
        "伊會食會睏，你免煩惱",
        "想著彼層代誌，伊規身軀煞挽脈",
        "日頭遮爾猛，天氣有夠熱",
        "樓跤有人咧喝咻，毋知是啥物代誌",
        "忍氣求財，激氣相刣",
        "囡仔兄，你欲去佗位？",
        "伊看著人攏喙笑目笑，真有人緣",
        "眠床頂衫亂㧒，袂輸咧漚鹹菜咧",
        "大碗是冬筍肉絲湯，細碗香菇雞湯",
        "這枝竹仔長躼埽，強欲拄天",
        "你明知伊做歹，閣欲共伊鬥相共！",
        "上下班時間，oo-tóo-bái佮自動車蓋濟，欲行過車路著特別細膩",
        "揣頭路揣規月日攏揣無，我哪會遮衰潲",
        "你這个死囡仔，叫你顧店，你煞走出去耍！",
        "攏是你傷倖伊，才致使伊今仔日會變按呢",
        "你對這條路直直行，攏免轉斡，行成十分鐘就會到",
        "塗跤一半擺仔無拭，袂偌垃圾啦！",
        "果子大出的時上好食，價數閣俗",
        "風颱咧欲來矣，真濟漁船仔攏駛入來港口閃風",
        "阿公逐工透早起來，攏會佇稻埕走標",
        "人死了後，身軀會變硬",
        "好額散，免怨嘆",
        "今仔日的菜白汫無味，你敢是袂記得摻鹽？",
        "物件積傷濟，無所在通囥",
        "法院的判決無公平，伊欲閣上訴",
        "干焦有人跋筊了家伙，無人跋筊好額的",
        "伊腹腸闊，袂佮人計較",
        "弓蕉猶無夠分，食著會咬舌",
        "這擺的數目敢若無啥著，你欲閣對一擺無？",
        "馬花糋是用麵粉做的閣糋過的物件，毋通食傷濟",
        "咧耍的時陣毋通共人繏嚨喉，真危險",
        "彼个阿婆老硞硞矣，猶閣咧做生理",
        "這月日趁較有錢，生活會較冗剩",
        "伊的靠山真有夠力，所以才會遮爾聳鬚",
        "彼个後生敢若柴頭尪仔，見擺問伊代誌攏袂曉小應一下",
        "注意安全，毋通冒險",
        "新聞有咧報，興食檳榔的人，若去食著倒吊子中毒，有時會無命",
        "欲落山著冗早，若開始罩雺，看袂著路就危險",
        "張總的頂擺出張，去巡視海外的工場，佇遐蹛個外月",
        "你若有代誌你先走，遮予我來煞尾",
        "屈咧寫，跤會麻",
        "是，我連鞭去做",
        "兩个鬥空欲騙你的錢，你著較細膩咧！",
        "伊真𠢕軁鑽，隨揣著頭路",

        "誠歹勢，我無拄好煞共恁的玻璃杯仔摃破去",
        "彼間新開的海產店，麥仔酒予你啉迵海的",
        "一丈差九尺，差遠咧",
        "今仔日親情族孫攏來矣，阿媽足歡喜的",
        "伊的人較土直，毋才較會去得失人",
        "你送遮爾大的禮，我受當袂起",
        "這領衫手䘼傷狹，我的手囊袂入去",
        "落塗時，八字命",
        "兩个袂輸一對鴛鴦，出入攏做陣",
        "幾若年無見面，你猶是佮以前仝款",
        "大人大種矣，磕袂著就起跤動手，有夠卸世眾！",
        "萬般皆是命，半點不由人",
        "這張圖真媠，我欲描一張起來",
        "老人面皮抾襇，會挾死胡蠅",
        "伊是自願來的，毋是我共伊硬押來的",
        "這陣的車攏自排的較濟，較毋免定定拍速矣",
        "茶苦苦，啉袂落去",
        "阿公決定的代誌，無人會當阻止",
        "這个地名按怎來的，已經無才調稽考矣",
        "伊古意閣好笑神，真深緣，予人愈看愈中意",
        "共遮的蝦笱下蹛溪裡，掠看有蝦仔無",
        "伊是虎鼻師，啥物味都鼻會出來",
        "牽罟倚索分魚有人有份，大肚分雙份",
        "老母一下死，囡仔就大聲吼",
        "逐擺攏是伊咧拍通關，真正是海量！",
        "你做你放心，時到一定有貴人會出現",
        "因為伊著痧，我毋才共伊放血",
        "食老了後目睭花花，看報紙足食力",
        "柿粿𩚨嗲嗲、甜粅粅，真好食",
        "這擺的損失，全部由我賠償",
        "伊毋願予人冤枉坐監，佇監獄咬舌自殺",
        "伊咧遏花，緊共喝予走",
        "伊運動傷過激烈，無細膩煞破鼎去",
        "兩个毋是親兄弟，是叔伯的",
        "我的錯誤造成你的損失，來共你會失禮是該然的",
        "彼支刀真久無用，已經生鉎矣！",
        "我來唱歌，你來跳舞",
        "一切攏就你的意思，按呢好無？",
        "半暝仔一个人行路轉去，心肝內小可膽膽",
        "這種木瓜品質真好，你提一寡仔木瓜子去湠種",
        "頭毛留長長，儉錢食塗豆糖",
        "水傷冷，我毋敢落去泅",
        "你若不時欲做違法的代誌，早慢會予人㨑去接受處份",
        "這个大善人去予人冤枉，實在無天理！",
        "咱三年無相揣矣，我感覺你這馬敢若有較長進",
        "金光黨一个做囮，假做有錢的戇囝，一个就鼓舞受害者去佮伊換錢",
        "伊連一點仔機會都毋予我，我誠毋願",
        "伊真關心老大人，定定去養老院拜訪",
        "咱這勻的人攏較有讀冊，無像頂勻的人受教育的機會真少",
        "伊已經四十歲矣，當然嘛急欲娶某",
        "出珠的人毋通四界走，才袂去共人穢著",
        "咱店的生理，攏是主顧客鬥捀場，才有穩定的收入",
        "我有寫批予伊，毋過伊攏無回覆我",
        "今年弓蕉產量穩定、價數好，蕉農逐个攏喙笑目笑",
        "人無來，提鞋範來和",
        "我看兩个是天生相剋，才會見面就相觸",
        "伊貪著人好額，才會去予人招",
        "伊生做遐爾仔媠，逐伊的人是窒倒街",
        "一暗無眠，三日踅神",
        "伊的手股頭有刺字， 穿吊䘥仔就看現現",
        "報名到昨昏是上尾工，今仔日才欲報就袂赴矣",
        "伊真有食福，每一擺來，我攏拄好咧煮好料的",
        "你一个面敢若死人面，一點仔血色都無",
        "共頭毛摠規摠，束起來",
        "規工枵飽吵，強欲予你煩死！",
        "伊真久無納貸款，厝煞予銀行估去",
        "這口灶的囝孫仔，逐个都真出擢",
        "我老罔老，跤手猶真儼硬",
        "伊佮人對相十外回，相無一个有佮意的",
        "城市愈來愈楦大，市郊嘛愈來愈鬧熱",
        "伊病好矣，早起看著有較清彩",
        "你較安靜咧，有人咧睏晝",
        "看著人翁仔某的感情遐爾仔好，無，你是咧食醋是無？",
        "寧可信其有，不可信其無",
        "布幼仔抾倚來，會使車做桌布",
        "五日節舉辦扒龍船比賽，來看鬧熱的民眾挨挨陣陣，人插插插",
        "嬰仔唔唔睏，一暝大一寸",
        "聽著音樂聲，逐家就綴咧合唱",
        "隔壁咧娶新娘，咱來去看鬧熱",
        "激骨話刁工共話意藏佇話裡，予聽的人去掠話骨",
        "伊看著活跳跳，一點仔都無成破病的人",
        "你較細膩咧，毋通滑倒",
        "諾，原來是按呢喔！",
        "道士作法，呼請天兵天將鬥相共",
        "六月火燒埔，真正會熱死人",
        "六月火燒埔，真正會驚死人",
        "六月火燒埔，真正會寒死人",
        "拄才風一下吹，門雄雄迸一聲，原來是門後的門擋仔歹去矣",
        "這屑仔物件遮濟人欲食，一定食袂夠氣",
        "兩姊妹仔無依無倚，按呢毋是辦法",
        "彼个唱歌唱了上好的人，是阮姊仔",
        "這批機器著先改裝，才會當配合新的規格",
        "阿仁仔真攝屎，才幾箍銀仔爾爾都毋甘出",
        "伊咧睏會鼾，佮伊睏足吵的",
        "泉水水質若好，泡的茶特別好啉",
        "你若是無法度一擺總納，抑無，看欲分做幾期？",
        "伊真有膽量，啥物攏毋驚",
        "遮日頭照袂著，誠暗",
        "牛車駛入湳塗，駛袂行",
        "扣掉本錢，實趁三千",
        "伊早日是牽牛車的，這馬變成大頭家",
        "時機誠䆀，害我十二生相變透透嘛變無撚",
        "若是肯奮鬥，一定會出頭",
        "不時走便所，專是你的詼諧",
        "阿公真韌命，細漢的時拄著幾若擺空襲攏無代誌",
    ]
    #inputLIST = ["地動發生到今(4/10)是第八工，砂卡礑步道猶是走揣的重點。今仔早重機具佇步道繼續挖，有揣著兩名死者，可能是姓游的爸爸和查某囝，佇這兩位死者的下跤閣挖著兩个死者，是相攬的姿勢。第三位可能是媽媽，而且佇身軀頂有揣著伊和三个囡仔的健保卡，另外佇咧暗頭仔也閣挖著一位死者，應該是上細漢的查某囝，若無意外，挖出來這五个人就是一家伙仔。",]
    #inputLIST = ["信義區",]
    for inputSTR in inputLIST:
        resultDICT = articutTaigi.parse(inputSTR, level="lv2")
        print("\n")
        pprint(resultDICT["result_pos"])
        pprint(resultDICT["result_segmentation"])
        print("=================================")

    #inputSTR = "阿明聽了，煞想著一个問題：「若準風颱嘛算是一種自然的現象，為啥物咱猶原愛驚惶伊？」老大人笑笑仔共伊講：「因為咱攏無了解風颱，所以才會感覺驚惶。」".replace("。", "")
    #resultDICT = articutTaigi.parse(inputSTR, level="lv2")
    #pprint(resultDICT)
    #<ENTITY_pronoun>[^<]+</ENTITY_pronoun>(<FUNC_inner>[^<]+</FUNC_inner>)?<ENTITY_noun>[^<]+</ENTITY_noun><DegreeP>[^<]+</DegreeP>